jankaluza/qsimkit/CPU/Variants/msp430xE42x.cpp
#ifndef U0BR0_
#define U0BR0_ 0x0074
#endif
#ifndef MC0
#define MC0 0x0010
#endif
#ifndef MPY_
#define MPY_ 0x0130
#endif
#ifndef WDTCTL_
#define WDTCTL_ 0x0120
#endif
#ifndef URXSE
#define URXSE 0x08
#endif
#ifndef U0BR1_
#define U0BR1_ 0x0075
#endif
#ifndef UBR0_
#define UBR0_ 0x0074
#endif
#ifndef XCAP10PF
#define XCAP10PF 0x10
#endif
#ifndef RET16_
#define RET16_ 0x01E0
#endif
#ifndef __msp430_headers_flash_h
#define __msp430_headers_flash_h 
#endif
#ifndef FLL_CTL0_
#define FLL_CTL0_ 0x0053
#endif
#ifndef SCG1
#define SCG1 0x0080
#endif
#ifndef FCTL1_
#define FCTL1_ 0x0128
#endif
#ifndef UBR1_
#define UBR1_ 0x0075
#endif
#ifndef FLL_CTL1_
#define FLL_CTL1_ 0x0054
#endif
#ifndef TA0CCTL0_
#define TA0CCTL0_ 0x0162
#endif
#ifndef RET27_
#define RET27_ 0x01F6
#endif
#ifndef LINECYCLCNT_HI
#define LINECYCLCNT_HI RET29
#endif
#ifndef MC_UPTO_CCR0
#define MC_UPTO_CCR0 MC_1
#endif
#ifndef SSEL_2
#define SSEL_2 0x20
#endif
#ifndef PENA
#define PENA 0x80
#endif
#ifndef TA0CCTL1_
#define TA0CCTL1_ 0x0164
#endif
#ifndef MC_UPDOWN
#define MC_UPDOWN MC_3
#endif
#ifndef __IOMACROS_H_
#define __IOMACROS_H_ 
#endif
#ifndef TA0CCTL2_
#define TA0CCTL2_ 0x0166
#endif
#ifndef U0CTL_
#define U0CTL_ 0x0070
#endif
#ifndef __msp430_headers_common_h
#define __msp430_headers_common_h 
#endif
#ifndef SCFQ_512K
#define SCFQ_512K 0x0F
#endif
#ifndef CKPH
#define CKPH 0x80
#endif
#ifndef UCTL_
#define UCTL_ 0x0070
#endif
#ifndef CKPL
#define CKPL 0x40
#endif
#ifndef U0IE
#define U0IE IE1
#endif
#ifndef __ASSEMBLER__
#define __ASSEMBLER__ 1
#endif
#ifndef LINECYCLCNT_LO
#define LINECYCLCNT_LO RET28
#endif
#ifndef VLDOFF
#define VLDOFF 0x00
#endif
#ifndef URCTL_
#define URCTL_ 0x0072
#endif
#ifndef SD16_VECTOR
#define SD16_VECTOR 24
#endif
#ifndef TXBUF_0_
#define TXBUF_0_ 0x0077
#endif
#ifndef SD16CTL_
#define SD16CTL_ 0x0100
#endif
#ifndef UCTL_0_
#define UCTL_0_ 0x0070
#endif
#ifndef __MSP430_HAS_BT__
#define __MSP430_HAS_BT__ 
#endif
#ifndef __HAVE_BUILTIN_SETJMP__
#define __HAVE_BUILTIN_SETJMP__ 1
#endif
#ifndef SD16GAIN1
#define SD16GAIN1 0x0010
#endif
#ifndef IRMS_HI
#define IRMS_HI RET25
#endif
#ifndef U0ME
#define U0ME ME1
#endif
#ifndef SD16GAIN2
#define SD16GAIN2 0x0020
#endif
#ifndef __msp430_have_port1
#define __msp430_have_port1 
#endif
#ifndef TACCR0
#define TACCR0 TA0CCR0
#endif
#ifndef TACCR1
#define TACCR1 TA0CCR1
#endif
#ifndef POWERFCT
#define POWERFCT RET20
#endif
#ifndef OP2_
#define OP2_ 0x0138
#endif
#ifndef TA0R_
#define TA0R_ 0x0170
#endif
#ifndef __msp430_have_port2
#define __msp430_have_port2 
#endif
#ifndef BTCTL_
#define BTCTL_ 0x0040
#endif
#ifndef LISTEN
#define LISTEN 0x08
#endif
#ifndef SUMEXT_
#define SUMEXT_ 0x013E
#endif
#ifndef P1IE_
#define P1IE_ 0x0025
#endif
#ifndef USART0TX_VECTOR
#define USART0TX_VECTOR 16
#endif
#ifndef SD16OVIFG
#define SD16OVIFG 0x0020
#endif
#ifndef P1OUT_
#define P1OUT_ 0x0021
#endif
#ifndef ESP430_VECTOR
#define ESP430_VECTOR 26
#endif
#ifndef LCDM10_
#define LCDM10_ LCD_BASE+0xA
#endif
#ifndef RET10_
#define RET10_ 0x01D4
#endif
#ifndef AFECTL
#define AFECTL SD16CTL
#endif
#ifndef __msp430_headers_sd16_h__
#define __msp430_headers_sd16_h__ 
#endif
#ifndef LCDM11_
#define LCDM11_ LCD_BASE+0xB
#endif
#ifndef USART0RX_VECTOR
#define USART0RX_VECTOR 18
#endif
#ifndef RET11_
#define RET11_ 0x01D6
#endif
#ifndef SEGWRT
#define SEGWRT 0x0080
#endif
#ifndef SCFQ_256K
#define SCFQ_256K 0x07
#endif
#ifndef LCDM12_
#define LCDM12_ LCD_BASE+0xC
#endif
#ifndef SYNC
#define SYNC 0x04
#endif
#ifndef P1SEL_
#define P1SEL_ 0x0026
#endif
#ifndef SD16MEM2_
#define SD16MEM2_ __MSP430_SD16MEM_BASE__ + 0x04
#endif
#ifndef RET12_
#define RET12_ 0x01D8
#endif
#ifndef OUT
#define OUT 0x0004
#endif
#ifndef CM_POS
#define CM_POS CM_1
#endif
#ifndef LCDM13_
#define LCDM13_ LCD_BASE+0xD
#endif
#ifndef FN0
#define FN0 0x0001
#endif
#ifndef FN1
#define FN1 0x0002
#endif
#ifndef FN2
#define FN2 0x0004
#endif
#ifndef FN3
#define FN3 0x0008
#endif
#ifndef FN4
#define FN4 0x0010
#endif
#ifndef FN5
#define FN5 0x0020
#endif
#ifndef SD16OSR0
#define SD16OSR0 0x0100
#endif
#ifndef SD16OSR1
#define SD16OSR1 0x0200
#endif
#ifndef LCDM14_
#define LCDM14_ LCD_BASE+0xE
#endif
#ifndef RET14_
#define RET14_ 0x01DC
#endif
#ifndef RESLO_
#define RESLO_ 0x013A
#endif
#ifndef LCDM15_
#define LCDM15_ LCD_BASE+0xF
#endif
#ifndef CM_BOTH
#define CM_BOTH CM_3
#endif
#ifndef RET15_
#define RET15_ 0x01DE
#endif
#ifndef FSSEL_SMCLK
#define FSSEL_SMCLK FSSEL_2
#endif
#ifndef TASSEL_SMCLK
#define TASSEL_SMCLK TASSEL_2
#endif
#ifndef __SIZE_TYPE__
#define __SIZE_TYPE__ unsigned int
#endif
#ifndef XCAP0PF
#define XCAP0PF 0x00
#endif
#ifndef UBR00_
#define UBR00_ 0x0074
#endif
#ifndef LCDM16_
#define LCDM16_ LCD_BASE+0x10
#endif
#ifndef UTCTL0_
#define UTCTL0_ 0x0071
#endif
#ifndef SD16DIV1
#define SD16DIV1 0x0080
#endif
#ifndef LCDM17_
#define LCDM17_ LCD_BASE+0x11
#endif
#ifndef LCDM1_
#define LCDM1_ LCDMEM_
#endif
#ifndef U0TCTL_
#define U0TCTL_ 0x0071
#endif
#ifndef TXEPT
#define TXEPT 0x01
#endif
#ifndef RET17_
#define RET17_ 0x01E2
#endif
#ifndef SD16SNGL
#define SD16SNGL 0x0400
#endif
#ifndef SD16INTDLY0
#define SD16INTDLY0 0x0040
#endif
#ifndef SD16INTDLY1
#define SD16INTDLY1 0x0080
#endif
#ifndef BTDIV
#define BTDIV 0x20
#endif
#ifndef LCDM18_
#define LCDM18_ LCD_BASE+0x12
#endif
#ifndef LCDM2_
#define LCDM2_ LCD_BASE+0x2
#endif
#ifndef SCS
#define SCS 0x0800
#endif
#ifndef MBOUT0_
#define MBOUT0_ 0x0158
#endif
#ifndef BT_fLCD_DIV32
#define BT_fLCD_DIV32 0
#endif
#ifndef CCTL1
#define CCTL1 TA0CCTL1
#endif
#ifndef LCDM19_
#define LCDM19_ LCD_BASE+0x13
#endif
#ifndef SSEL_SMCLK
#define SSEL_SMCLK SSEL_2
#endif
#ifndef LPM0
#define LPM0 CPUOFF
#endif
#ifndef LPM2
#define LPM2 SCG1+CPUOFF
#endif
#ifndef LCDM3_
#define LCDM3_ LCD_BASE+0x3
#endif
#ifndef LPM4
#define LPM4 SCG1+SCG0+OSCOFF+CPUOFF
#endif
#ifndef MBOUT1_
#define MBOUT1_ 0x015A
#endif
#ifndef RET19_
#define RET19_ 0x01E6
#endif
#ifndef LCDM4_
#define LCDM4_ LCD_BASE+0x4
#endif
#ifndef SD16SSEL_MCLK
#define SD16SSEL_MCLK SD16SSEL_0
#endif
#ifndef __GNUC_PATCHLEVEL__
#define __GNUC_PATCHLEVEL__ 3
#endif
#ifndef XCAP14PF
#define XCAP14PF 0x20
#endif
#ifndef __MSP430_HAS_FLLPLUS_SMALL__
#define __MSP430_HAS_FLLPLUS_SMALL__ 
#endif
#ifndef LCDM5_
#define LCDM5_ LCD_BASE+0x5
#endif
#ifndef V1RMS
#define V1RMS RET23
#endif
#ifndef RESHI_
#define RESHI_ 0x013C
#endif
#ifndef OUTMOD_RESET
#define OUTMOD_RESET OUTMOD_5
#endif
#ifndef FSSEL0
#define FSSEL0 0x0040
#endif
#ifndef FSSEL1
#define FSSEL1 0x0080
#endif
#ifndef LCDM6_
#define LCDM6_ LCD_BASE+0x6
#endif
#ifndef RET30_
#define RET30_ 0x01FC
#endif
#ifndef WAVEFSI1
#define WAVEFSI1 RET5
#endif
#ifndef FLLD0
#define FLLD0 0x40
#endif
#ifndef FLLD1
#define FLLD1 0x80
#endif
#ifndef FLLD_1
#define FLLD_1 0
#endif
#ifndef ESP430_STAT0
#define ESP430_STAT0 RET0
#endif
#ifndef ESP430_STAT1
#define ESP430_STAT1 RET1
#endif
#ifndef LCDM7_
#define LCDM7_ LCD_BASE+0x7
#endif
#ifndef RET31_
#define RET31_ 0x01FE
#endif
#ifndef SD16SSEL0
#define SD16SSEL0 0x0010
#endif
#ifndef SD16SSEL1
#define SD16SSEL1 0x0020
#endif
#ifndef LCDM8_
#define LCDM8_ LCD_BASE+0x8
#endif
#ifndef SD16IFG
#define SD16IFG 0x0004
#endif
#ifndef LCDM9_
#define LCDM9_ LCD_BASE+0x9
#endif
#ifndef ACTENERGY1_HI
#define ACTENERGY1_HI RET9
#endif
#ifndef ACCVIFG
#define ACCVIFG 0x0004
#endif
#ifndef P2DIR_
#define P2DIR_ 0x002A
#endif
#ifndef CM_NEG
#define CM_NEG CM_2
#endif
#ifndef SD16CCTL0_
#define SD16CCTL0_ 0x0102
#endif
#ifndef FXKEY
#define FXKEY 0x3300
#endif
#ifndef SD16CCTL1_
#define SD16CCTL1_ 0x0104
#endif
#ifndef __MSP430_SD16IV_BASE__
#define __MSP430_SD16IV_BASE__ 0x110
#endif
#ifndef UBR0_0_
#define UBR0_0_ 0x0074
#endif
#ifndef __MSP430_HAS_SD16_CH2__
#define __MSP430_HAS_SD16_CH2__ 
#endif
#ifndef BIT1
#define BIT1 0x0002
#endif
#ifndef BIT2
#define BIT2 0x0004
#endif
#ifndef BIT3
#define BIT3 0x0008
#endif
#ifndef BIT4
#define BIT4 0x0010
#endif
#ifndef BIT5
#define BIT5 0x0020
#endif
#ifndef BIT7
#define BIT7 0x0080
#endif
#ifndef BIT8
#define BIT8 0x0100
#endif
#ifndef BIT9
#define BIT9 0x0200
#endif
#ifndef SD16MEM0_
#define SD16MEM0_ __MSP430_SD16MEM_BASE__ + 0x00
#endif
#ifndef LCD_BASE
#define LCD_BASE 0x90
#endif
#ifndef BITA
#define BITA 0x0400
#endif
#ifndef BITB
#define BITB 0x0800
#endif
#ifndef BITC
#define BITC 0x1000
#endif
#ifndef BITD
#define BITD 0x2000
#endif
#ifndef BITE
#define BITE 0x4000
#endif
#ifndef BITF
#define BITF 0x8000
#endif
#ifndef SCG0
#define SCG0 0x0040
#endif
#ifndef BT_fCLK2_DIV2
#define BT_fCLK2_DIV2 0
#endif
#ifndef PORON
#define PORON 0x08
#endif
#ifndef CHAR
#define CHAR 0x10
#endif
#ifndef SD16CCTL2_
#define SD16CCTL2_ 0x0106
#endif
#ifndef SPB
#define SPB 0x20
#endif
#ifndef WDTCNTCL
#define WDTCNTCL 0x0008
#endif
#ifndef TAIV_CCR2
#define TAIV_CCR2 0x04
#endif
#ifndef TAIV_CCR1
#define TAIV_CCR1 0x02
#endif
#ifndef CCTL0_
#define CCTL0_ TA0CCTL0_
#endif
#ifndef MPYS_
#define MPYS_ 0x0132
#endif
#ifndef LCDMA_
#define LCDMA_ LCDM10_
#endif
#ifndef OUTMOD0
#define OUTMOD0 0x0020
#endif
#ifndef CCTL1_
#define CCTL1_ TA0CCTL1_
#endif
#ifndef BASICTIMER_VECTOR
#define BASICTIMER_VECTOR 0
#endif
#ifndef LCDMEM_
#define LCDMEM_ LCD_BASE+1
#endif
#ifndef SVSFG
#define SVSFG 0x01
#endif
#ifndef LCDMB_
#define LCDMB_ LCDM11_
#endif
#ifndef NMI_VECTOR
#define NMI_VECTOR 28
#endif
#ifndef RXERR
#define RXERR 0x01
#endif
#ifndef CCTL2_
#define CCTL2_ TA0CCTL2_
#endif
#ifndef STC
#define STC 0x02
#endif
#ifndef LCDMC_
#define LCDMC_ LCDM12_
#endif
#ifndef WAVEFSV1
#define WAVEFSV1 RET2
#endif
#ifndef LCDMD_
#define LCDMD_ LCDM13_
#endif
#ifndef LCDMEM
#define LCDMEM LCDMEM_
#endif
#ifndef CAPIND
#define CAPIND RET21
#endif
#ifndef LCDME_
#define LCDME_ LCDM14_
#endif
#ifndef BT_fCLK2_MCLK
#define BT_fCLK2_MCLK BTSSEL
#endif
#ifndef TASSEL_INCLK
#define TASSEL_INCLK TASSEL_3
#endif
#ifndef LCDMF_
#define LCDMF_ LCDM15_
#endif
#ifndef U0TXBUF_
#define U0TXBUF_ 0x0077
#endif
#ifndef UTCTL_0_
#define UTCTL_0_ 0x0071
#endif
#ifndef P2IFG_
#define P2IFG_ 0x002B
#endif
#ifndef TIMERA1_VECTOR
#define TIMERA1_VECTOR 10
#endif
#ifndef TASSEL_ACLK
#define TASSEL_ACLK TASSEL_1
#endif
#ifndef TA0CCR0_
#define TA0CCR0_ 0x0172
#endif
#ifndef TACTL_
#define TACTL_ TA0CTL_
#endif
#ifndef CCR0_
#define CCR0_ TA0CCR0_
#endif
#ifndef WDTNMI
#define WDTNMI 0x0020
#endif
#ifndef SD16DF
#define SD16DF 0x0010
#endif
#ifndef TA0CCR1_
#define TA0CCR1_ 0x0174
#endif
#ifndef CCR1_
#define CCR1_ TA0CCR1_
#endif
#ifndef OUTMOD_OUT
#define OUTMOD_OUT OUTMOD_0
#endif
#ifndef DCOF
#define DCOF 0x01
#endif
#ifndef TA0CCR2_
#define TA0CCR2_ 0x0176
#endif
#ifndef FSSEL_MCLK
#define FSSEL_MCLK FSSEL_1
#endif
#ifndef LCDCTL_
#define LCDCTL_ LCD_BASE
#endif
#ifndef __MSP430_SD16MEM_BASE__
#define __MSP430_SD16MEM_BASE__ 0x112
#endif
#ifndef SVSON
#define SVSON 0x04
#endif
#ifndef URCTL_0_
#define URCTL_0_ 0x0072
#endif
#ifndef SVSOP
#define SVSOP 0x02
#endif
#ifndef RXBUF_
#define RXBUF_ 0x0076
#endif
#ifndef WDT_VECTOR
#define WDT_VECTOR 20
#endif
#ifndef TACCTL1_
#define TACCTL1_ TA0CCTL1_
#endif
#ifndef LPM1
#define LPM1 SCG0+CPUOFF
#endif
#ifndef XCAP18PF
#define XCAP18PF 0x30
#endif
#ifndef CAP
#define CAP 0x0100
#endif
#ifndef LPM3
#define LPM3 SCG1+SCG0+CPUOFF
#endif
#ifndef U0IFG
#define U0IFG IFG1
#endif
#ifndef SD16IE
#define SD16IE 0x0008
#endif
#ifndef __USER_LABEL_PREFIX__
#define __USER_LABEL_PREFIX__ 
#endif
#ifndef CCI
#define CCI 0x0008
#endif
#ifndef NMBMEAS_HI
#define NMBMEAS_HI RET31
#endif
#ifndef __STDC_HOSTED__
#define __STDC_HOSTED__ 1
#endif
#ifndef __MSP430_HAS_LCD4__
#define __MSP430_HAS_LCD4__ 
#endif
#ifndef SD16LP
#define SD16LP 0x0100
#endif
#ifndef OUTMOD_SET
#define OUTMOD_SET OUTMOD_1
#endif
#ifndef SD16LSBTOG
#define SD16LSBTOG 0x0080
#endif
#ifndef OUTMOD_RESET_SET
#define OUTMOD_RESET_SET OUTMOD_7
#endif
#ifndef RET18_
#define RET18_ 0x01E4
#endif
#ifndef MC_STOP
#define MC_STOP MC_0
#endif
#ifndef __msp430_headers_mpy_h
#define __msp430_headers_mpy_h 
#endif
#ifndef TASSEL_TACLK
#define TASSEL_TACLK TASSEL_0
#endif
#ifndef ID_DIV1
#define ID_DIV1 ID_0
#endif
#ifndef ID_DIV2
#define ID_DIV2 ID_1
#endif
#ifndef ID_DIV4
#define ID_DIV4 ID_2
#endif
#ifndef ID_DIV8
#define ID_DIV8 ID_3
#endif
#ifndef TACLR
#define TACLR 0x0004
#endif
#ifndef APPENERGY_HI
#define APPENERGY_HI RET15
#endif
#ifndef __MSP430_HAS_FLASH__
#define __MSP430_HAS_FLASH__ 
#endif
#ifndef MERAS
#define MERAS 0x0004
#endif
#ifndef __MSP430__
#define __MSP430__ 1
#endif
#ifndef RXWAKE
#define RXWAKE 0x02
#endif
#ifndef U0RCTL_
#define U0RCTL_ 0x0072
#endif
#ifndef SD16VMIDON
#define SD16VMIDON 0x0008
#endif
#ifndef __WCHAR_TYPE__
#define __WCHAR_TYPE__ int
#endif
#ifndef __msp430_headers_system_clock_h
#define __msp430_headers_system_clock_h 
#endif
#ifndef EMEX
#define EMEX 0x0020
#endif
#ifndef APPENERGY_LO
#define APPENERGY_LO RET14
#endif
#ifndef LCDMX0
#define LCDMX0 0x08
#endif
#ifndef LCDMX1
#define LCDMX1 0x10
#endif
#ifndef UMCTL_0_
#define UMCTL_0_ 0x0073
#endif
#ifndef OUTMOD_TOGGLE_RESET
#define OUTMOD_TOGGLE_RESET OUTMOD_2
#endif
#ifndef CM0
#define CM0 0x4000
#endif
#ifndef CM1
#define CM1 0x8000
#endif
#ifndef WRT
#define WRT 0x0040
#endif
#ifndef P1IFG_
#define P1IFG_ 0x0023
#endif
#ifndef WDTPW
#define WDTPW 0x5A00
#endif
#ifndef AFEINCTL0
#define AFEINCTL0 SD16INCTL0
#endif
#ifndef AFEINCTL1
#define AFEINCTL1 SD16INCTL1
#endif
#ifndef AFEINCTL2
#define AFEINCTL2 SD16INCTL2
#endif
#ifndef VLD_1_8V
#define VLD_1_8V 0x10
#endif
#ifndef LCDOG1_7
#define LCDOG1_7 0x00
#endif
#ifndef COV
#define COV 0x0002
#endif
#ifndef OUTMOD_TOGGLE
#define OUTMOD_TOGGLE OUTMOD_4
#endif
#ifndef TACTL
#define TACTL TA0CTL
#endif
#ifndef __MSP430_HAS_PORT2__
#define __MSP430_HAS_PORT2__ 
#endif
#ifndef UART0TX_VECTOR
#define UART0TX_VECTOR USART0TX_VECTOR
#endif
#ifndef VLDON
#define VLDON 0x10
#endif
#ifndef SCFQ_M
#define SCFQ_M 0x80
#endif
#ifndef __MSP430_HAS_MPY__
#define __MSP430_HAS_MPY__ 
#endif
#ifndef __INT_MAX__
#define __INT_MAX__ 32767
#endif
#ifndef MACS_
#define MACS_ 0x0136
#endif
#ifndef TXBUF0_
#define TXBUF0_ 0x0077
#endif
#ifndef TACCR2
#define TACCR2 TA0CCR2
#endif
#ifndef SD16SSEL_SMCLK
#define SD16SSEL_SMCLK SD16SSEL_1
#endif
#ifndef FWKEY
#define FWKEY 0xA500
#endif
#ifndef __msp430_headers_basic_timer_h
#define __msp430_headers_basic_timer_h 
#endif
#ifndef UART0RX_VECTOR
#define UART0RX_VECTOR USART0RX_VECTOR
#endif
#ifndef SSEL0
#define SSEL0 0x10
#endif
#ifndef SSEL1
#define SSEL1 0x20
#endif
#ifndef KEYV
#define KEYV 0x0002
#endif
#ifndef P2IE_
#define P2IE_ 0x002D
#endif
#ifndef PEV
#define PEV 0x40
#endif
#ifndef XTS_FLL
#define XTS_FLL 0x40
#endif
#ifndef LOCK
#define LOCK 0x0010
#endif
#ifndef __msp430_headers_svs_h
#define __msp430_headers_svs_h 
#endif
#ifndef RET13_
#define RET13_ 0x01DA
#endif
#ifndef RXBUF0_
#define RXBUF0_ 0x0076
#endif
#ifndef IFG1_
#define IFG1_ 0x0002
#endif
#ifndef P2IN_
#define P2IN_ 0x0028
#endif
#ifndef __WINT_TYPE__
#define __WINT_TYPE__ unsigned int
#endif
#ifndef __GNUC__
#define __GNUC__ 3
#endif
#ifndef SWRST
#define SWRST 0x01
#endif
#ifndef AFECCTL0
#define AFECCTL0 SD16CCTL0
#endif
#ifndef AFECCTL2
#define AFECCTL2 SD16CCTL02
#endif
#ifndef XT1OF
#define XT1OF 0x04
#endif
#ifndef PORT2_VECTOR
#define PORT2_VECTOR 2
#endif
#ifndef __msp430_headers_gpio_h
#define __msp430_headers_gpio_h 
#endif
#ifndef FSSEL_0
#define FSSEL_0 0x0000
#endif
#ifndef CCIE
#define CCIE 0x0010
#endif
#ifndef MAC_
#define MAC_ 0x0134
#endif
#ifndef __MSP430_HAS_UART0__
#define __MSP430_HAS_UART0__ 
#endif
#ifndef TA0CTL_
#define TA0CTL_ 0x0160
#endif
#ifndef IFG2_
#define IFG2_ 0x0003
#endif
#ifndef __msp430_have_lcd_16_20
#define __msp430_have_lcd_16_20 
#endif
#ifndef LCDON
#define LCDON 0x01
#endif
#ifndef MBIN0_
#define MBIN0_ 0x0154
#endif
#ifndef LCDP0
#define LCDP0 0x20
#endif
#ifndef LCDP1
#define LCDP1 0x40
#endif
#ifndef LCDP2
#define LCDP2 0x80
#endif
#ifndef SD16SSEL_ACLK
#define SD16SSEL_ACLK SD16SSEL_2
#endif
#ifndef AFECCTL1
#define AFECCTL1 SD16CCTL1
#endif
#ifndef MBIN1_
#define MBIN1_ 0x0156
#endif
#ifndef LCDSG0
#define LCDSG0 0x00
#endif
#ifndef FE
#define FE 0x80
#endif
#ifndef BT_ADLY_0_064
#define BT_ADLY_0_064 0
#endif
#ifndef __MSP430_HAS_SVS__
#define __MSP430_HAS_SVS__ 
#endif
#ifndef BTRESET
#define BTRESET 0x40
#endif
#ifndef ME1_
#define ME1_ 0x0004
#endif
#ifndef TAIE
#define TAIE 0x0002
#endif
#ifndef GIE
#define GIE 0x0008
#endif
#ifndef TAIV
#define TAIV TA0IV
#endif
#ifndef OUTMOD_SET_RESET
#define OUTMOD_SET_RESET OUTMOD_3
#endif
#ifndef TACCR1_
#define TACCR1_ TA0CCR1_
#endif
#ifndef BTCNT1_
#define BTCNT1_ 0x0046
#endif
#ifndef P1DIR_
#define P1DIR_ 0x0022
#endif
#ifndef BTFRFQ0
#define BTFRFQ0 0x08
#endif
#ifndef BTFRFQ1
#define BTFRFQ1 0x10
#endif
#ifndef LCDM20_
#define LCDM20_ LCD_BASE+0x14
#endif
#ifndef FLL_DIV0
#define FLL_DIV0 0x01
#endif
#ifndef FLL_DIV1
#define FLL_DIV1 0x02
#endif
#ifndef WDTIS1
#define WDTIS1 0x0002
#endif
#ifndef BLKWRT
#define BLKWRT 0x0080
#endif
#ifndef RET20_
#define RET20_ 0x01E8
#endif
#ifndef TACCR2_
#define TACCR2_ TA0CCR2_
#endif
#ifndef BTCNT2_
#define BTCNT2_ 0x0047
#endif
#ifndef OUTMOD_TOGGLE_SET
#define OUTMOD_TOGGLE_SET OUTMOD_6
#endif
#ifndef RET21_
#define RET21_ 0x01EA
#endif
#ifndef SSEL_UCLKI
#define SSEL_UCLKI SSEL_0
#endif
#ifndef CCTL0
#define CCTL0 TA0CCTL0
#endif
#ifndef CCTL2
#define CCTL2 TA0CCTL2
#endif
#ifndef __msp430_headers_esp430e_h
#define __msp430_headers_esp430e_h 
#endif
#ifndef CCR0
#define CCR0 TA0CCR0
#endif
#ifndef CCR1
#define CCR1 TA0CCR1
#endif
#ifndef CCR2
#define CCR2 TA0CCR2
#endif
#ifndef URXWIE
#define URXWIE 0x04
#endif
#ifndef MC_CONT
#define MC_CONT MC_2
#endif
#ifndef RET22_
#define RET22_ 0x01EC
#endif
#ifndef IRMS_LO
#define IRMS_LO RET24
#endif
#ifndef TAIFG
#define TAIFG 0x0001
#endif
#ifndef RET0_
#define RET0_ 0x01C0
#endif
#ifndef MSP430_NO_HW_MUL
#define MSP430_NO_HW_MUL 1
#endif
#ifndef RET23_
#define RET23_ 0x01EE
#endif
#ifndef SD16SC
#define SD16SC 0x0002
#endif
#ifndef SD16MEM1_
#define SD16MEM1_ __MSP430_SD16MEM_BASE__ + 0x02
#endif
#ifndef RET1_
#define RET1_ 0x01C2
#endif
#ifndef TAIV_NONE
#define TAIV_NONE 0x00
#endif
#ifndef BT_fLCD_1K
#define BT_fLCD_1K 0
#endif
#ifndef RET24_
#define RET24_ 0x01F0
#endif
#ifndef MM
#define MM 0x02
#endif
#ifndef TACCR0_
#define TACCR0_ TA0CCR0_
#endif
#ifndef RET2_
#define RET2_ 0x01C4
#endif
#ifndef LCDSON
#define LCDSON 0x04
#endif
#ifndef ID0
#define ID0 0x0040
#endif
#ifndef ID1
#define ID1 0x0080
#endif
#ifndef CCIS0
#define CCIS0 0x1000
#endif
#ifndef CCIS1
#define CCIS1 0x2000
#endif
#ifndef RET25_
#define RET25_ 0x01F2
#endif
#ifndef UBR10_
#define UBR10_ 0x0075
#endif
#ifndef RET3_
#define RET3_ 0x01C6
#endif
#ifndef RET26_
#define RET26_ 0x01F4
#endif
#ifndef __USING_SJLJ_EXCEPTIONS__
#define __USING_SJLJ_EXCEPTIONS__ 1
#endif
#ifndef OE
#define OE 0x20
#endif
#ifndef __MSP430_HAS_SD16_CH1__
#define __MSP430_HAS_SD16_CH1__ 
#endif
#ifndef SD16OVIE
#define SD16OVIE 0x0002
#endif
#ifndef RET4_
#define RET4_ 0x01C8
#endif
#ifndef SVSCTL_
#define SVSCTL_ 0x0056
#endif
#ifndef SSEL_0
#define SSEL_0 0x00
#endif
#ifndef SSEL_1
#define SSEL_1 0x10
#endif
#ifndef SSEL_3
#define SSEL_3 0x30
#endif
#ifndef PE
#define PE 0x40
#endif
#ifndef RET5_
#define RET5_ 0x01CA
#endif
#ifndef LFOF
#define LFOF 0x02
#endif
#ifndef TAR_
#define TAR_ TA0R_
#endif
#ifndef CCR2_
#define CCR2_ TA0CCR2_
#endif
#ifndef SD16PRE0_
#define SD16PRE0_ 0x00B8
#endif
#ifndef RET28_
#define RET28_ 0x01F8
#endif
#ifndef WDTTMSEL
#define WDTTMSEL 0x0010
#endif
#ifndef RXBUF_0_
#define RXBUF_0_ 0x0076
#endif
#ifndef RET6_
#define RET6_ 0x01CC
#endif
#ifndef SD16PRE1_
#define SD16PRE1_ 0x00B9
#endif
#ifndef RET29_
#define RET29_ 0x01FA
#endif
#ifndef RET7_
#define RET7_ 0x01CE
#endif
#ifndef BT_fCLK2_ACLK_DIV256
#define BT_fCLK2_ACLK_DIV256 BTDIV
#endif
#ifndef ERASE
#define ERASE 0x0002
#endif
#ifndef SD16PRE2_
#define SD16PRE2_ 0x00BA
#endif
#ifndef SCFQ_1M
#define SCFQ_1M 0x1F
#endif
#ifndef RET8_
#define RET8_ 0x01D0
#endif
#ifndef __MSP430_HAS_WDT__
#define __MSP430_HAS_WDT__ 
#endif
#ifndef SCFQ_2M
#define SCFQ_2M 0x3F
#endif
#ifndef SCFI0_
#define SCFI0_ 0x0050
#endif
#ifndef RET9_
#define RET9_ 0x01D2
#endif
#ifndef SD16INCTL0_
#define SD16INCTL0_ 0x00B0
#endif
#ifndef SCFI1_
#define SCFI1_ 0x0051
#endif
#ifndef BT_fCLK2_ACLK
#define BT_fCLK2_ACLK 0x00
#endif
#ifndef UTCTL_
#define UTCTL_ 0x0071
#endif
#ifndef SD16INCTL1_
#define SD16INCTL1_ 0x00B1
#endif
#ifndef SCFQ_4M
#define SCFQ_4M 0x7F
#endif
#ifndef TXBUF_
#define TXBUF_ 0x0077
#endif
#ifndef URCTL0_
#define URCTL0_ 0x0072
#endif
#ifndef IPEAK
#define IPEAK RET27
#endif
#ifndef SD16INCTL2_
#define SD16INCTL2_ 0x00B2
#endif
#ifndef SCFQ_128K
#define SCFQ_128K 0x03
#endif
#ifndef UCTL0_
#define UCTL0_ 0x0070
#endif
#ifndef OUTMOD1
#define OUTMOD1 0x0040
#endif
#ifndef OUTMOD2
#define OUTMOD2 0x0080
#endif
#ifndef ACTENSPER1_HI
#define ACTENSPER1_HI RET17
#endif
#ifndef __msp430_headers_lcd_h
#define __msp430_headers_lcd_h 
#endif
#ifndef WAIT
#define WAIT 0x0008
#endif
#ifndef FSSEL_ACLK
#define FSSEL_ACLK FSSEL_0
#endif
#ifndef IE2_
#define IE2_ 0x0001
#endif
#ifndef FSSEL_1
#define FSSEL_1 0x0040
#endif
#ifndef FSSEL_2
#define FSSEL_2 0x0080
#endif
#ifndef FSSEL_3
#define FSSEL_3 0x00C0
#endif
#ifndef UMCTL0_
#define UMCTL0_ 0x0073
#endif
#ifndef UMCTL_
#define UMCTL_ 0x0073
#endif
#ifndef BIT0
#define BIT0 0x0001
#endif
#ifndef URXEIE
#define URXEIE 0x08
#endif
#ifndef REACTENERGY_HI
#define REACTENERGY_HI RET13
#endif
#ifndef TAIV_
#define TAIV_ TA0IV_
#endif
#ifndef SD16SSEL_TACLK
#define SD16SSEL_TACLK SD16SSEL_3
#endif
#ifndef SD16GAIN0
#define SD16GAIN0 0x0008
#endif
#ifndef __GXX_ABI_VERSION
#define __GXX_ABI_VERSION 102
#endif
#ifndef BIT6
#define BIT6 0x0040
#endif
#ifndef __msp430_headers_timera_h__
#define __msp430_headers_timera_h__ 
#endif
#ifndef TAR
#define TAR TA0R
#endif
#ifndef IE1_
#define IE1_ 0x0000
#endif
#ifndef WDTHOLD
#define WDTHOLD 0x0080
#endif
#ifndef TASSEL0
#define TASSEL0 0x0100
#endif
#ifndef TASSEL1
#define TASSEL1 0x0200
#endif
#ifndef TASSEL2
#define TASSEL2 0x0400
#endif
#ifndef BUSY
#define BUSY 0x0001
#endif
#ifndef TA0IV_
#define TA0IV_ 0x012E
#endif
#ifndef SD16DIV0
#define SD16DIV0 0x0040
#endif
#ifndef __msp430xE42x
#define __msp430xE42x 
#endif
#ifndef SD16GRP
#define SD16GRP 0x0001
#endif
#ifndef CCIFG
#define CCIFG 0x0001
#endif
#ifndef P1IES_
#define P1IES_ 0x0024
#endif
#ifndef REACTENERGY_LO
#define REACTENERGY_LO RET12
#endif
#ifndef TXWAKE
#define TXWAKE 0x04
#endif
#ifndef MBCTL_
#define MBCTL_ 0x0152
#endif
#ifndef __GNUC_MINOR__
#define __GNUC_MINOR__ 2
#endif
#ifndef __MSP430
#define __MSP430 1
#endif
#ifndef ESPCTL_
#define ESPCTL_ 0x0150
#endif
#ifndef FLL_DIV_1
#define FLL_DIV_1 0x00
#endif
#ifndef FLL_DIV_2
#define FLL_DIV_2 0x01
#endif
#ifndef FLL_DIV_4
#define FLL_DIV_4 0x02
#endif
#ifndef FLL_DIV_8
#define FLL_DIV_8 0x03
#endif
#ifndef VPEAK
#define VPEAK RET26
#endif
#ifndef SD16INCH1
#define SD16INCH1 0x0002
#endif
#ifndef TACCTL0_
#define TACCTL0_ TA0CCTL0_
#endif
#ifndef WDTSSEL
#define WDTSSEL 0x0004
#endif
#ifndef __STDC__
#define __STDC__ 1
#endif
#ifndef MC1
#define MC1 0x0020
#endif
#ifndef SSEL_ACLK
#define SSEL_ACLK SSEL_1
#endif
#ifndef WDTIS_0
#define WDTIS_0 0x0000
#endif
#ifndef WDTIS_1
#define WDTIS_1 0x0001
#endif
#ifndef WDTIS_2
#define WDTIS_2 0x0002
#endif
#ifndef WDTIS_3
#define WDTIS_3 0x0003
#endif
#ifndef __PTRDIFF_TYPE__
#define __PTRDIFF_TYPE__ int
#endif
#ifndef UBR1_0_
#define UBR1_0_ 0x0075
#endif
#ifndef FCTL2_
#define FCTL2_ 0x012A
#endif
#ifndef TAIV_OVERFLOW
#define TAIV_OVERFLOW 0x0A
#endif
#ifndef SCFQCTL_
#define SCFQCTL_ 0x0052
#endif
#ifndef P2IES_
#define P2IES_ 0x002C
#endif
#ifndef TACCTL2_
#define TACCTL2_ TA0CCTL2_
#endif
#ifndef DCOPLUS
#define DCOPLUS 0x80
#endif
#ifndef FCTL3_
#define FCTL3_ 0x012C
#endif
#ifndef MSP430
#define MSP430 1
#endif
#ifndef BTSSEL
#define BTSSEL 0x80
#endif
#ifndef P1IN_
#define P1IN_ 0x0020
#endif
#ifndef BTHOLD
#define BTHOLD 0x40
#endif
#ifndef SD16LSBACC
#define SD16LSBACC 0x0040
#endif
#ifndef SD16CONF0_
#define SD16CONF0_ 0x00B7
#endif
#ifndef U0MCTL_
#define U0MCTL_ 0x0073
#endif
