jankaluza/qsimkit/CPU/Variants/msp430xE42x.cpp
#ifndef __msp430_headers_usart_h
#define __msp430_headers_usart_h 
#endif
#ifndef SD16CONF1_
#define SD16CONF1_ 0x00BF
#endif
#ifndef ACTENERGY1_LO
#define ACTENERGY1_LO RET8
#endif
#ifndef TIMERA0_VECTOR
#define TIMERA0_VECTOR 12
#endif
#ifndef CPUOFF
#define CPUOFF 0x0010
#endif
#ifndef TACCTL2
#define TACCTL2 TA0CCTL2
#endif
#ifndef ACTENSPER1_LO
#define ACTENSPER1_LO RET16
#endif
#ifndef WDTNMIES
#define WDTNMIES 0x0040
#endif
#ifndef NMBMEAS_LO
#define NMBMEAS_LO RET30
#endif
#ifndef MAINSPERIOD
#define MAINSPERIOD RET22
#endif
#ifndef __REGISTER_PREFIX__
#define __REGISTER_PREFIX__ 
#endif
#ifndef SD16REFON
#define SD16REFON 0x0004
#endif
#ifndef FN_2
#define FN_2 0x04
#endif
#ifndef FN_3
#define FN_3 0x08
#endif
#ifndef FN_4
#define FN_4 0x10
#endif
#ifndef FN_8
#define FN_8 0x20
#endif
#ifndef U0RXBUF_
#define U0RXBUF_ 0x0076
#endif
#ifndef CM_DISABLE
#define CM_DISABLE CM_0
#endif
#ifndef SD16DIV_DIV1
#define SD16DIV_DIV1 SD16DIV_0
#endif
#ifndef SD16DIV_DIV2
#define SD16DIV_DIV2 SD16DIV_1
#endif
#ifndef SD16DIV_DIV4
#define SD16DIV_DIV4 SD16DIV_2
#endif
#ifndef SD16DIV_DIV8
#define SD16DIV_DIV8 SD16DIV_3
#endif
#ifndef P2OUT_
#define P2OUT_ 0x0029
#endif
#ifndef OSCOFF
#define OSCOFF 0x0020
#endif
#ifndef PORT1_VECTOR
#define PORT1_VECTOR 8
#endif
#ifndef FRKEY
#define FRKEY 0x9600
#endif
#ifndef __MSP430_HAS_TA3__
#define __MSP430_HAS_TA3__ 
#endif
#ifndef TACCTL0
#define TACCTL0 TA0CCTL0
#endif
#ifndef TACCTL1
#define TACCTL1 TA0CCTL1
#endif
#ifndef __MSP430_HAS_PORT1__
#define __MSP430_HAS_PORT1__ 
#endif
#ifndef BTIP0
#define BTIP0 0x01
#endif
#ifndef BTIP1
#define BTIP1 0x02
#endif
#ifndef BTIP2
#define BTIP2 0x04
#endif
#ifndef WDTIS0
#define WDTIS0 0x0001
#endif
#ifndef __NO_INLINE__
#define __NO_INLINE__ 1
#endif
#ifndef SD16IV_
#define SD16IV_ __MSP430_SD16IV_BASE__
#endif
#ifndef SCCI
#define SCCI 0x0400
#endif
#ifndef P2SEL_
#define P2SEL_ 0x002E
#endif
#ifndef BRK
#define BRK 0x10
#endif
#ifndef SD16INCH0
#define SD16INCH0 0x0001
#endif
#ifndef SD16INCH2
#define SD16INCH2 0x0004
#endif
#ifndef __VERSION__
#define __VERSION__ "3.2.3"
#endif
#ifndef C
#define C 0x0001
#endif
#ifndef N
#define N 0x0004
#endif
#ifndef V
#define V 0x0100
#endif
#ifndef Z
#define Z 0x0002
#endif
#include "CPU/Variants/Variant.h"
#include "CPU/Variants/VariantManager.h"

class Variant_msp430xE42x : public Variant {
	public:
		Variant_msp430xE42x() {}
		virtual ~Variant_msp430xE42x() {}
		const char *getName() { return "msp430xE42x"; }

		unsigned int getP1DIR() {
#ifdef P1DIR_
			return P1DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP1IE() {
#ifdef P1IE_
			return P1IE_;
#else
			return 0;
#endif
		}


		unsigned int getP1IES() {
#ifdef P1IES_
			return P1IES_;
#else
			return 0;
#endif
		}


		unsigned int getP1IFG() {
#ifdef P1IFG_
			return P1IFG_;
#else
			return 0;
#endif
		}


		unsigned int getP1IN() {
#ifdef P1IN_
			return P1IN_;
#else
			return 0;
#endif
		}


		unsigned int getP1OUT() {
#ifdef P1OUT_
			return P1OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP1REN() {
#ifdef P1REN_
			return P1REN_;
#else
			return 0;
#endif
		}


		unsigned int getP1SEL() {
#ifdef P1SEL_
			return P1SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP2DIR() {
#ifdef P2DIR_
			return P2DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP2IE() {
#ifdef P2IE_
			return P2IE_;
#else
			return 0;
#endif
		}


		unsigned int getP2IES() {
#ifdef P2IES_
			return P2IES_;
#else
			return 0;
#endif
		}


		unsigned int getP2IFG() {
#ifdef P2IFG_
			return P2IFG_;
#else
			return 0;
#endif
		}


		unsigned int getP2IN() {
#ifdef P2IN_
			return P2IN_;
#else
			return 0;
#endif
		}


		unsigned int getP2OUT() {
#ifdef P2OUT_
			return P2OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP2REN() {
#ifdef P2REN_
			return P2REN_;
#else
			return 0;
#endif
		}


		unsigned int getP2SEL() {
#ifdef P2SEL_
			return P2SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP3DIR() {
#ifdef P3DIR_
			return P3DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP3IN() {
#ifdef P3IN_
			return P3IN_;
#else
			return 0;
#endif
		}


		unsigned int getP3OUT() {
#ifdef P3OUT_
			return P3OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP3REN() {
#ifdef P3REN_
			return P3REN_;
#else
			return 0;
#endif
		}


		unsigned int getP3SEL() {
#ifdef P3SEL_
			return P3SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP4DIR() {
#ifdef P4DIR_
			return P4DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP4IN() {
#ifdef P4IN_
			return P4IN_;
#else
			return 0;
#endif
		}


		unsigned int getP4OUT() {
#ifdef P4OUT_
			return P4OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP4REN() {
#ifdef P4REN_
			return P4REN_;
#else
			return 0;
#endif
		}


		unsigned int getP4SEL() {
#ifdef P4SEL_
			return P4SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP5DIR() {
#ifdef P5DIR_
			return P5DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP5IN() {
#ifdef P5IN_
			return P5IN_;
#else
			return 0;
#endif
		}


		unsigned int getP5OUT() {
#ifdef P5OUT_
			return P5OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP5REN() {
#ifdef P5REN_
			return P5REN_;
#else
			return 0;
#endif
		}


		unsigned int getP5SEL() {
#ifdef P5SEL_
			return P5SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP6DIR() {
#ifdef P6DIR_
			return P6DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP6IN() {
#ifdef P6IN_
			return P6IN_;
#else
			return 0;
#endif
		}


		unsigned int getP6OUT() {
#ifdef P6OUT_
			return P6OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP6REN() {
#ifdef P6REN_
			return P6REN_;
#else
			return 0;
#endif
		}


		unsigned int getP6SEL() {
#ifdef P6SEL_
			return P6SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP7DIR() {
#ifdef P7DIR_
			return P7DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP7IN() {
#ifdef P7IN_
			return P7IN_;
#else
			return 0;
#endif
		}


		unsigned int getP7OUT() {
#ifdef P7OUT_
			return P7OUT_;
#else
			return 0;
#endif
		}


