jankaluza/qsimkit/CPU/Variants/msp430xE42x.cpp
		unsigned int getP7REN() {
#ifdef P7REN_
			return P7REN_;
#else
			return 0;
#endif
		}


		unsigned int getP7SEL() {
#ifdef P7SEL_
			return P7SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP8DIR() {
#ifdef P8DIR_
			return P8DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP8IN() {
#ifdef P8IN_
			return P8IN_;
#else
			return 0;
#endif
		}


		unsigned int getP8OUT() {
#ifdef P8OUT_
			return P8OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP8REN() {
#ifdef P8REN_
			return P8REN_;
#else
			return 0;
#endif
		}


		unsigned int getP8SEL() {
#ifdef P8SEL_
			return P8SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP9DIR() {
#ifdef P9DIR_
			return P9DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP9IN() {
#ifdef P9IN_
			return P9IN_;
#else
			return 0;
#endif
		}


		unsigned int getP9OUT() {
#ifdef P9OUT_
			return P9OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP9REN() {
#ifdef P9REN_
			return P9REN_;
#else
			return 0;
#endif
		}


		unsigned int getP9SEL() {
#ifdef P9SEL_
			return P9SEL_;
#else
			return 0;
#endif
		}


		unsigned int getP10DIR() {
#ifdef P10DIR_
			return P10DIR_;
#else
			return 0;
#endif
		}


		unsigned int getP10IN() {
#ifdef P10IN_
			return P10IN_;
#else
			return 0;
#endif
		}


		unsigned int getP10OUT() {
#ifdef P10OUT_
			return P10OUT_;
#else
			return 0;
#endif
		}


		unsigned int getP10REN() {
#ifdef P10REN_
			return P10REN_;
#else
			return 0;
#endif
		}


		unsigned int getP10SEL() {
#ifdef P10SEL_
			return P10SEL_;
#else
			return 0;
#endif
		}


		unsigned int getPORT1_VECTOR() {
#ifdef PORT1_VECTOR
			return PORT1_VECTOR;
#else
			return 0;
#endif
		}


		unsigned int getPORT2_VECTOR() {
#ifdef PORT2_VECTOR
			return PORT2_VECTOR;
#else
			return 0;
#endif
		}


};

MSP430_VARIANT("msp430xE42x", msp430xE42x);

